mhaberler/canopennode/CANopen_stack/PIC24H_dsPIC33F/CO_driver.h
/*******************************************************************************

   File: CO_driver.h
   CAN module object for Microchip dsPIC33F or PIC24H and Microchip C30 compiler (>= V3.00).

   Copyright (C) 2004-2010 Janez Paternoster

   License: GNU Lesser General Public License (LGPL).

   <http://canopennode.sourceforge.net>
*/
/*
   This program is free software: you can redistribute it and/or modify
   it under the terms of the GNU Lesser General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU Lesser General Public License for more details.

   You should have received a copy of the GNU Lesser General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.


   Author: Janez Paternoster

*******************************************************************************/

#ifndef _CO_DRIVER_H
#define _CO_DRIVER_H


#include <p33fxxxx.h>       //processor header file


/*******************************************************************************
   Topic: Reception of CAN messages

   Received message is processed by <Receive CAN message function>.

   CAN device has number of receive buffers equal to number of different CANopen
   receiving objects. Each buffer accepts CAN messages with specific identifier
   (which can also be masked). If CAN message is accepted by specific buffer,
   then function pointed by _pFunct_ is called with two parameters: pointer
   to object and pointer to received mesaage. Function is valid for specific
   CANopen object and it copies contents from received message into variables
   inside object. For more information see <Receive CAN message function> and
   <CO_CANrxBufferInit> functions.

   Benefits of this principle are: fast response, low memory usage and very
   high flexibility.


********************************************************************************
   Topic: Transmission of CAN messages

   CAN device has number of transmit buffers equal to number of different CANopen
   transmitting objects. Buffers are stored inside <CO_CANmodule_t> as members
   of <CO_CANtxArray_t>.

   Each buffer must be configured with <CO_CANtxBufferInit> function before it
   is used. Function returns pointer to 8 byte CAN data buffer which should be
   populated before CAN message is sent.

   CANmessage is send with calling <CO_CANsend> function, which accepts two
   argument: pointer to CAN device and pointer to tx buffer returned by 
   <CO_CANtxBufferInit> function. If any hardware CAN transmit buffer is free,
   message is copied directly to CAN module and _bufferFull_ variable from
   <CO_CANtxArray_t> stays false. If no hardware CAN transmit buffer is free,
   <CO_CANsend> function sets _bufferFull_ to true; message will be then sent by
   CAN TX interrupt. Until message is not copied to CAN module, its contents
   must not change.

   Advantages of this principle:
    - Code for transmission of messages is very fast.
    - Higher priority messages are transmited first.
    - Buffer full is indicated only on the individual messages. Other buffers
      may be still free.
*******************************************************************************/


/*******************************************************************************
   Constants: CANopen basic data types

   For dsPIC33F and PIC24H with Microchip C30:
      CO_OD_ROM_IDENT   - Identifier for CO_OD_ROM varibbles is none, so variables are stored in RAM.
      UNSIGNED8         - Of type unsigned char
      UNSIGNED16        - Of type unsigned int
      UNSIGNED32        - Of type unsigned long int
      UNSIGNED64        - Of type unsigned long long int
      INTEGER8          - Of type char
      INTEGER16         - Of type int
      INTEGER32         - Of type long
      INTEGER64         - Of type long long int
      REAL32            - Of type float
      REAL64            - Of type long double
      VISIBLE_STRING    - Of type char
      OCTET_STRING      - Of type unsigned char
*******************************************************************************/
   #define CO_OD_ROM_IDENT

   #define UNSIGNED8       unsigned char
   #define UNSIGNED16      unsigned int
   #define UNSIGNED32      unsigned long int
   #define UNSIGNED64      unsigned long long int
   #define INTEGER8        char
   #define INTEGER16       int
   #define INTEGER32       long int
   #define INTEGER64       long long int
   #define REAL32          float
   #define REAL64          long double
   #define VISIBLE_STRING  char
   #define OCTET_STRING    unsigned char


/*******************************************************************************
   Constants: CO_ReturnError

   Return values of most CANopen functions. If function was executed
   successfully it returns 0 otherwise it returns <0.

    0 = CO_ERROR_NO                 - Operation completed successfully.
   -1 = CO_ERROR_ILLEGAL_ARGUMENT   - Error in function arguments.
   -2 = CO_ERROR_OUT_OF_MEMORY      - Memory allocation failed.
   -3 = CO_ERROR_TIMEOUT            - Function timeout.
   -4 = CO_ERROR_ILLEGAL_BAUDRATE   - Illegal baudrate passed to function <CO_CANmodule_init>
   -5 = CO_ERROR_RX_OVERFLOW        - Previous message was not processed yet.
   -6 = CO_ERROR_RX_PDO_OWERFLOW    - previous PDO was not processed yet.
   -7 = CO_ERROR_RX_MSG_LENGTH      - Wrong receive message length.
   -8 = CO_ERROR_RX_PDO_LENGTH      - Wrong receive PDO length.
   -9 = CO_ERROR_TX_OVERFLOW        - Previous message is still waiting, buffer full.
   -10 = CO_ERROR_TX_PDO_WINDOW     - Synchronous TPDO is outside window.
   -11 = CO_ERROR_TX_UNCONFIGURED   - Transmit buffer was not confugured properly.
*******************************************************************************/
   enum CO_ReturnError{
      CO_ERROR_NO                = 0,
      CO_ERROR_ILLEGAL_ARGUMENT  = -1,
      CO_ERROR_OUT_OF_MEMORY     = -2,
      CO_ERROR_TIMEOUT           = -3,
      CO_ERROR_ILLEGAL_BAUDRATE  = -4,
      CO_ERROR_RX_OVERFLOW       = -5,
      CO_ERROR_RX_PDO_OWERFLOW   = -6,
      CO_ERROR_RX_MSG_LENGTH     = -7,
      CO_ERROR_RX_PDO_LENGTH     = -8,
      CO_ERROR_TX_OVERFLOW       = -9,
      CO_ERROR_TX_PDO_WINDOW     = -10,
      CO_ERROR_TX_UNCONFIGURED   = -11,
   };


