mhaberler/canopennode/CANopen_stack/PIC24H_dsPIC33F/CO_driver.h
/*******************************************************************************
   Constants: Peripheral addresses

   ADDR_CAN1      - Starting address of CAN module 1 registers.
   ADDR_CAN2      - Starting address of CAN module 2 registers.

   ADDR_DMA0      - Starting address of DMA 0 configuration registers.
   ...            - ...
   ADDR_DMA7      - Starting address of DMA 7 configuration registers.
 *******************************************************************************/
#define ADDR_CAN1    0x400
#define ADDR_CAN2    0x500

#define ADDR_DMA0    0x380
#define ADDR_DMA1    0x38C
#define ADDR_DMA2    0x398
#define ADDR_DMA3    0x3A4
#define ADDR_DMA4    0x3B0
#define ADDR_DMA5    0x3BC
#define ADDR_DMA6    0x3C8
#define ADDR_DMA7    0x3D4


/*******************************************************************************
   Macros: Masking interrupts

   Interrupt masking is used to protect critical sections.

   It is used in few places in library to protect short sections of code.

      DISABLE_INTERRUPTS()     - Disable all interrupts.
      ENABLE_INTERRUPTS()      - Reenable interrupts.
*******************************************************************************/
#define DISABLE_INTERRUPTS()     asm volatile ("disi #0x3FFF")
#define ENABLE_INTERRUPTS()      asm volatile ("disi #0x0000")


/*******************************************************************************
   Macros: CAN bit rates

   CAN bit rates are initializers for array of eight <CO_CANbitRateData_t>
   objects.

   Macros are not used by driver itself, they may be used by application with
   combination with object <CO_CANbitRateData_t>.
   Application must declare following global variable depending on CO_FCY used:
   const CO_CANbitRateData_t  CO_CANbitRateData[8] = {CO_CANbitRateDataInitializers};

   There are initializers for eight objects, which corresponds to following
   CAN bit rates (in kbps): 10, 20, 50, 125, 250, 500, 800, 1000.

   CO_FCY is internal instruction cycle clock frequency in kHz units. See
   dsPIC33F documentation for more information on FCY.

   Possible values for FCY are (in three groups):
      - Optimal CAN bit timing on all Baud Rates: 8000, 12000, 16000, 24000.
      - Not so optimal CAN bit timing on all Baud Rates: 4000, 32000.
      - not all CANopen Baud Rates possible: 2000, 3000, 5000, 6000, 10000,
        20000, 40000.

   IMPORTANT: For FCY<=12000 there is unresolved bug; CANCKS configuration
              bit on ECAN does not work, so some baudrates are not possible.
*******************************************************************************/
#ifdef CO_FCY
   //Macros, which divides K into (SJW + PROP + PhSeg1 + PhSeg2)
   #define TQ_x_4    1, 1, 1, 1
   #define TQ_x_5    1, 1, 2, 1
   #define TQ_x_6    1, 1, 3, 1
   #define TQ_x_8    1, 2, 3, 2
   #define TQ_x_9    1, 2, 4, 2
   #define TQ_x_10   1, 3, 4, 2
   #define TQ_x_12   1, 3, 6, 2
   #define TQ_x_14   1, 4, 7, 2
   #define TQ_x_15   1, 4, 8, 2  //good timing
   #define TQ_x_16   1, 5, 8, 2  //good timing
   #define TQ_x_19   1, 8, 8, 2  //good timing
   #define TQ_x_20   1, 8, 8, 3  //good timing
   #define TQ_x_21   1, 8, 8, 4
   #define TQ_x_25   1, 8, 8, 8

   #if CO_FCY == 2000
      #define CO_CANbitRateDataInitializers  \
      {1, 5,   TQ_x_20},   /*CAN=10kbps*/    \
      {2, 5,   TQ_x_20},   /*CAN=20kbps*/    \
      {1, 1,   TQ_x_20},   /*CAN=50kbps*/    \
      {2, 1,   TQ_x_16},   /*CAN=125kbps*/   \
      {2, 1,   TQ_x_8 },   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_4 },   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_4 },   /*Not possible*/  \
      {2, 1,   TQ_x_4 }    /*Not possible*/
   #elif CO_FCY == 3000
      #define CO_CANbitRateDataInitializers  \
      {2, 15,  TQ_x_20},   /*CAN=10kbps*/    \
      {1, 5,   TQ_x_15},   /*CAN=20kbps*/    \
      {1, 2,   TQ_x_15},   /*CAN=50kbps*/    \
      {1, 1,   TQ_x_12},   /*CAN=125kbps*/   \
      {2, 1,   TQ_x_12},   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_6 },   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_6 },   /*Not possible*/  \
      {2, 1,   TQ_x_6 }    /*Not possible*/
   #elif CO_FCY == 4000
      #define CO_CANbitRateDataInitializers  \
      {2, 25,  TQ_x_16},   /*CAN=10kbps*/    \
      {1, 5,   TQ_x_20},   /*CAN=20kbps*/    \
      {2, 5,   TQ_x_16},   /*CAN=50kbps*/    \
      {1, 1,   TQ_x_16},   /*CAN=125kbps*/   \
      {2, 1,   TQ_x_16},   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_8 },   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_5 },   /*CAN=800kbps*/   \
      {2, 1,   TQ_x_4 }    /*CAN=1000kbps*/
   #elif CO_FCY == 5000
      #define CO_CANbitRateDataInitializers  \
      {2, 25,  TQ_x_20},   /*CAN=10kbps*/    \
      {1, 5,   TQ_x_25},   /*CAN=20kbps*/    \
      {2, 5,   TQ_x_20},   /*CAN=50kbps*/    \
      {1, 1,   TQ_x_20},   /*CAN=125kbps*/   \
      {2, 1,   TQ_x_20},   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_10},   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_10},   /*Not possible*/  \
      {2, 1,   TQ_x_5 }    /*CAN=1000kbps*/
   #elif CO_FCY == 6000
      #define CO_CANbitRateDataInitializers  \
      {1, 20,  TQ_x_15},   /*CAN=10kbps*/    \
      {1, 10,  TQ_x_15},   /*CAN=20kbps*/    \
      {1, 4,   TQ_x_15},   /*CAN=50kbps*/    \
      {2, 3,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 1,   TQ_x_12},   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_12},   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_12},   /*Not possible*/  \
      {2, 1,   TQ_x_6 }    /*CAN=1000kbps*/
   #elif CO_FCY == 8000
      #define CO_CANbitRateDataInitializers  \
      {1, 25,  TQ_x_16},   /*CAN=10kbps*/    \
      {2, 25,  TQ_x_16},   /*CAN=20kbps*/    \
      {1, 5,   TQ_x_16},   /*CAN=50kbps*/    \
      {1, 2,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 1,   TQ_x_16},   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_16},   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_10},   /*CAN=800kbps*/   \
      {2, 1,   TQ_x_8 }    /*CAN=1000kbps*/
   #elif CO_FCY == 10000
      #define CO_CANbitRateDataInitializers  \
      {1, 25,  TQ_x_20},   /*CAN=10kbps*/    \
      {2, 25,  TQ_x_20},   /*CAN=20kbps*/    \
      {1, 5,   TQ_x_20},   /*CAN=50kbps*/    \
      {2, 5,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 1,   TQ_x_20},   /*CAN=250kbps*/   \
      {2, 1,   TQ_x_20},   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_20},   /*Not possible*/  \
      {2, 1,   TQ_x_10}    /*CAN=1000kbps*/
   #elif CO_FCY == 12000
      #define CO_CANbitRateDataInitializers  \
      {2, 63,  TQ_x_19},   /*CAN=10kbps*/    \
      {1, 20,  TQ_x_15},   /*CAN=20kbps*/    \
      {2, 15,  TQ_x_16},   /*CAN=50kbps*/    \
      {1, 3,   TQ_x_16},   /*CAN=125kbps*/   \
      {2, 3,   TQ_x_16},   /*CAN=250kbps*/   \
      {1, 1,   TQ_x_12},   /*CAN=500kbps*/   \
      {2, 1,   TQ_x_15},   /*CAN=800kbps*/   \
      {2, 1,   TQ_x_12}    /*CAN=1000kbps*/
   #elif CO_FCY == 16000
      #define CO_CANbitRateDataInitializers  \
      {1, 50,  TQ_x_16},   /*CAN=10kbps*/    \
      {1, 25,  TQ_x_16},   /*CAN=20kbps*/    \
      {1, 10,  TQ_x_16},   /*CAN=50kbps*/    \
      {1, 4,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 2,   TQ_x_16},   /*CAN=250kbps*/   \
      {1, 1,   TQ_x_16},   /*CAN=500kbps*/   \
      {1, 1,   TQ_x_10},   /*CAN=800kbps*/   \
      {1, 1,   TQ_x_8 }    /*CAN=1000kbps*/
   #elif CO_FCY == 20000
      #define CO_CANbitRateDataInitializers  \
      {1, 50,  TQ_x_20},   /*CAN=10kbps*/    \
      {1, 25,  TQ_x_20},   /*CAN=20kbps*/    \
      {1, 10,  TQ_x_20},   /*CAN=50kbps*/    \
      {1, 5,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 2,   TQ_x_20},   /*CAN=250kbps*/   \
      {1, 1,   TQ_x_20},   /*CAN=500kbps*/   \
      {1, 1,   TQ_x_20},   /*Not possible*/  \
      {1, 1,   TQ_x_10}    /*CAN=1000kbps*/
   #elif CO_FCY == 24000
      #define CO_CANbitRateDataInitializers  \
      {1, 63,  TQ_x_19},   /*CAN=10kbps*/    \
      {1, 40,  TQ_x_15},   /*CAN=20kbps*/    \
      {1, 15,  TQ_x_16},   /*CAN=50kbps*/    \
      {1, 6,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 3,   TQ_x_16},   /*CAN=250kbps*/   \
      {1, 2,   TQ_x_12},   /*CAN=500kbps*/   \
      {1, 1,   TQ_x_15},   /*CAN=800kbps*/   \
      {1, 1,   TQ_x_12}    /*CAN=1000kbps*/
   #elif CO_FCY == 32000
      #define CO_CANbitRateDataInitializers  \
      {1, 64,  TQ_x_25},   /*CAN=10kbps*/    \
      {1, 50,  TQ_x_16},   /*CAN=20kbps*/    \
      {1, 20,  TQ_x_16},   /*CAN=50kbps*/    \
      {1, 8,   TQ_x_16},   /*CAN=125kbps*/   \
      {1, 4,   TQ_x_16},   /*CAN=250kbps*/   \
      {1, 2,   TQ_x_16},   /*CAN=500kbps*/   \
      {1, 2,   TQ_x_10},   /*CAN=800kbps*/   \
      {1, 1,   TQ_x_16}    /*CAN=1000kbps*/
   #elif CO_FCY == 40000
      #define CO_CANbitRateDataInitializers  \
      {1, 50,  TQ_x_20},   /*Not possible*/  \
      {1, 50,  TQ_x_20},   /*CAN=20kbps*/    \
      {1, 25,  TQ_x_16},   /*CAN=50kbps*/    \
      {1, 10,  TQ_x_16},   /*CAN=125kbps*/   \
      {1, 5,   TQ_x_16},   /*CAN=250kbps*/   \
      {1, 2,   TQ_x_20},   /*CAN=500kbps*/   \
      {1, 1,   TQ_x_25},   /*CAN=800kbps*/   \
      {1, 1,   TQ_x_20}    /*CAN=1000kbps*/
   #else
      #error define_CO_FCY CO_FCY not supported
   #endif
#endif


