mhaberler/canopennode/CANopen_stack/PIC24H_dsPIC33F/CO_driver.h
/*******************************************************************************
   Object: CO_CANbitRateData_t

   Structure contains timing coefficients for CAN module. See <CAN bit rates>.

   CAN baud rate is calculated from following equations:
   FCAN = FCY * Scale                  - Input frequency to CAN module (MAX 40MHz for dsPIC33F and PIC24H)
   TQ = 2 * BRP / FCAN                 - Time Quanta
   BaudRate = 1 / (TQ * K)             - Can bus Baud Rate
   K = SJW + PROP + PhSeg1 + PhSeg2    - Number of Time Quantas

   Variables:
      scale    - (1 or 2) Scales FCY clock - dsPIC33F and PIC24H specific.
      BRP      - (1...64) Baud Rate Prescaler.
      SJW      - (1...4) SJW time.
      PROP     - (1...8) PROP time.
      PhSeg1   - (1...8) Phase Segment 1 time.
      PhSeg2   - (1...8) Phase Segment 2 time.
*******************************************************************************/
typedef struct{
   UNSIGNED8   scale;
   UNSIGNED8   BRP;
   UNSIGNED8   SJW;
   UNSIGNED8   PROP;
   UNSIGNED8   phSeg1;
   UNSIGNED8   phSeg2;
}CO_CANbitRateData_t;


/*******************************************************************************
   Object: CO_CANrxMsg_t

   CAN receive message structure as aligned in CAN module. Object is passed to
   <Receive CAN message function>. In general, that function only uses _DLC_ and
   _data_ parameters. If it needs to read identifier, it must use function
   <CO_CANrxMsg_readIdent>.
   In dsPIC33F and PIC24H this structure is used for both: transmitting and
   receiving to and from CAN module. (Object is ownded by CAN module).

   Variables:
      ident             - Standard Identifier as aligned in CAN module. 16 bits:
                          'UUUSSSSS SSSSSSRE' (U: unused; S: SID; R=SRR; E=IDE).
      extIdent          - Extended identifier, not used here
      DLC               - Data length code (bits 0...3).
      DLCrest           - Not used here (bits 4..15).
      data              - 8 data bytes.
      dummy             - Not used.
      FILHIT            - Filter hit.
*******************************************************************************/
typedef struct{
   UNSIGNED16        ident;
   UNSIGNED16        extIdent;
   UNSIGNED16        DLC      :4;
   UNSIGNED16        DLCrest  :12;
   UNSIGNED8         data[8];
   UNSIGNED8         dummy;
   UNSIGNED8         FILHIT;
}CO_CANrxMsg_t;


/*******************************************************************************
   Object: CO_CANrxArray_t

   Array for handling received CAN messages.

   Variables:
      ident    - Standard Identifier as aligned in CAN module.
      mask     - Standard Identifier mask as aligned in CAN module.
      object   - See parameters in <CO_CANrxBufferInit>.
      pFunct   - See parameters in <CO_CANrxBufferInit>.
*******************************************************************************/
typedef struct{
   UNSIGNED16        ident;
   UNSIGNED16        mask;
   void             *object;
   INTEGER16       (*pFunct)(void *object, CO_CANrxMsg_t *message);
}CO_CANrxArray_t;


/*******************************************************************************
   Object: CO_CANtxArray_t

   Array for handling transmitting CAN messages.

   Variables:
      ident             - Standard Identifier as aligned in CAN module. 16 bits:
                          'SSSSSUUU SSSSSSRE' (U: unused; S: SID; R=SRR; E=IDE).
      DLC               - Data length code.
      data              - 8 data bytes.
      bufferFull        - Previous message is still in buffer.
      syncFlag          - Synchronous PDO messages has this flag set. It prevents them to be sent outside the synchronous window.
*******************************************************************************/
typedef struct{
   UNSIGNED16        ident;
   UNSIGNED8         DLC;
   UNSIGNED8         data[8];
   UNSIGNED8         bufferFull;
   UNSIGNED8         syncFlag;
}CO_CANtxArray_t;


/*******************************************************************************
   Object: CO_CANmodule_t

   Object controls CAN module.

   Variables:
      CANbaseAddress    - See parameters in <CO_CANmodule_init>.
      CANmsgBuff        - See parameters in <CO_CANmodule_init>.
      CANmsgBuffSize    - See parameters in <CO_CANmodule_init>.
      rxArray           - See parameters in <CO_CANmodule_init>.
      rxSize            - See parameters in <CO_CANmodule_init>.
      txArray           - See parameters in <CO_CANmodule_init>.
      txSize            - See parameters in <CO_CANmodule_init>.
      curentSyncTimeIsInsideWindow - Pointer to variable with same name inside
                          <CO_SYNC_t> object. This pointer is configured inside
                          <CO_SYNC_init> function.
      useCANrxFilters   - Value different than zero indicates, that CAN module
                          hardware filters are used for CAN reception. If there
                          is not enough hardware filters, they won't be used. In
                          this case will be _all_ received CAN messages processed
                          by software. dsPIC33F devices have 16 CAN rx filters.
      bufferInhibitFlag - If flag is true, then message in transmitt buffer is
                          synchronous PDO message, which will be aborted, if
                          <CO_clearPendingSyncPDOs> function will be called by
                          application. This may be necessary if Synchronous
                          window time was expired.
      firstCANtxMessage - Equal to 1, when the first transmitted message
                          (bootup message) is in CAN TX buffers.
      CANtxCount        - Number of messages in transmit buffer, which are
                          waiting to be copied to CAN module.
      errOld            - Previous state of CAN errors.
      EM                - Pointer to Emergency object <CO_emergencyReport_t>.
*******************************************************************************/
typedef struct{
   UNSIGNED16              CANbaseAddress;
   CO_CANrxMsg_t          *CANmsgBuff;
   UNSIGNED8               CANmsgBuffSize;
   CO_CANrxArray_t        *rxArray;
   UNSIGNED16              rxSize;
   CO_CANtxArray_t        *txArray;
   UNSIGNED16              txSize;
   UNSIGNED8              *curentSyncTimeIsInsideWindow;
   UNSIGNED8               useCANrxFilters;
   UNSIGNED8               bufferInhibitFlag;
   UNSIGNED8               firstCANtxMessage;
   UNSIGNED16              CANtxCount;
   UNSIGNED8               errOld;
   void                   *EM;
}CO_CANmodule_t;


