mhaberler/canopennode/CANopen_stack/PIC24H_dsPIC33F/CO_driver.h
/*******************************************************************************
   Function: memcpySwapN

   Copy N data bytes from source to destination. Swap bytes if necessary.
   CANopen uses little endian. dsPIC33F and PIC24H with Microchip C30 uses
   little endian. Functions just copy bytes without inversion.

   Parameters:
      dest        - Destination location.
      src         - Source location.
*******************************************************************************/
void memcpySwap2(UNSIGNED8* dest, UNSIGNED8* src);
void memcpySwap4(UNSIGNED8* dest, UNSIGNED8* src);
//#define BIG_ENDIAN


/*******************************************************************************
   Function: Receive CAN message function

   Process received CAN message.

   Different CANopen objects (like SDO) register their own functions, which
   will be called by CAN receive interrupt every time, when CAN message with
   matched identifier will be received. Function is then responsible to verify
   some basics, like message length or overflow. It must copy message contents
   to objects buffer.

   Parameters:
      object   - Pointer to object registered by <CO_CANrxBufferInit>.
      msg      - Pointer to CAN message (directly on CAN module) <CO_CANrxMsg_t>.

   Return <CO_ReturnError>:
      CO_ERROR_NO                 - Operation completed successfully.
      CO_ERROR_RX_OVERFLOW        - Previous message was not processed yet.
      CO_ERROR_RX_PDO_OWERFLOW    - previous PDO was not processed yet.
      CO_ERROR_RX_MSG_LENGTH      - Wrong receive message length.
      CO_ERROR_RX_PDO_LENGTH      - Wrong receive PDO length.
*******************************************************************************/


/*******************************************************************************
   Function: CO_CANsetConfigurationMode

   Requests CAN configuration (stopped) mode and *wait* untill it is set.

   Parameters:
      CANbaseAddress    - CAN module base address.
*******************************************************************************/
void CO_CANsetConfigurationMode(UNSIGNED16 CANbaseAddress);


/*******************************************************************************
   Function: CO_CANsetNormalMode

   Requests CAN normal (opearational) mode and *wait* untill it is set.

   Parameters:
      CANbaseAddress    - CAN module base address.
*******************************************************************************/
void CO_CANsetNormalMode(UNSIGNED16 CANbaseAddress);


/*******************************************************************************
   Function: CO_CANmodule_init

   Initialize CAN module object.

   Function must be called in the communication reset section. CAN module must
   be in Configuration Mode before.

   Parameters:
      ppCANmodule       - Pointer to address of CAN module object <CO_CANmodule_t>.
                          If address is zero, memory for new object will be
                          allocated and address will be set.
      CANbaseAddress    - CAN module base address. See <Peripheral addresses>.
      DMArxBaseAddress  - Base address for registers for DMA reception. See <Peripheral addresses>.
      DMAtxBaseAddress  - Base address for registers for DMA transmission. See <Peripheral addresses>.
      CANmsgBuff        - Pointer to CAN message buffer of type <CANMsgBuff> defined in DMA RAM.
      CANmsgBuffSize    - Size of above buffer.
      CANmsgBuffDMAoffset - DMA offset of the CANmsgBuff.
      rxSize            - Size of above array is equal to number of receiving CAN objects.
      txSize            - Size of above array is equal to number of transmitting CAN objects.
      CANbitRate        - CAN bit rate. Valid values are (in kbps): 10, 20, 50,
                          125, 250, 500, 800, 1000. If value is illegal, bitrate
                          defaults to 125.

   Return <CO_ReturnError>:
      CO_ERROR_NO                 - Operation completed successfully.
      CO_ERROR_ILLEGAL_ARGUMENT   - Error in function arguments.
      CO_ERROR_OUT_OF_MEMORY      - Memory allocation failed.
      CO_ERROR_ILLEGAL_BAUDRATE   - Illegal baudrate passed to function <CO_CANmodule_init>
*******************************************************************************/
INTEGER16 CO_CANmodule_init(
      CO_CANmodule_t     **ppCANmodule,
      UNSIGNED16           CANbaseAddress,
      UNSIGNED16           DMArxBaseAddress,
      UNSIGNED16           DMAtxBaseAddress,
      CO_CANrxMsg_t       *CANmsgBuff,
      UNSIGNED8            CANmsgBuffSize,
      UNSIGNED16           CANmsgBuffDMAoffset,
      UNSIGNED16           rxSize,
      UNSIGNED16           txSize,
      UNSIGNED16           CANbitRate);


/*******************************************************************************
   Function: CO_CANmodule_delete

   Delete CANmodule object and free memory.

   Parameters:
      ppCANmodule       - Pointer to pointer to CAN module object <CO_CANmodule_t>.
                          Pointer to CAN module object is set to 0.
*******************************************************************************/
void CO_CANmodule_delete(CO_CANmodule_t **ppCANmodule);


/*******************************************************************************
   Function: CO_CANrxMsg_readIdent

   Reads CAN identifier from received message.

   Parameters:
      rxMsg    - Pointer to received message. See <CO_CANrxMsg_t>.

   Return:
      11-bit CAN standard identifier.
*******************************************************************************/
UNSIGNED16 CO_CANrxMsg_readIdent(CO_CANrxMsg_t *rxMsg);


/*******************************************************************************
   Function: CO_CANrxBufferInit

   Configure CAN message receive buffer.

   Function configures specific CAN receive buffer. It sets CAN identifier
   and connects buffer with specific object. For more information see
   topic <Reception of CAN messages>.

   Parameters:
      CANmodule   - Pointer to CAN module object <CO_CANmodule_t>.
      index       - Index of CAN device receive buffer.
      ident       - 11-bit standard CAN Identifier.
      mask        - 11-bit mask for identifier. Most usually set to 0x7FF.
                    Received message (rcvMsg) will be accepted if the following
                    condition is true: (((rcvMsgId ^ ident) & mask) == 0).
      rtr         - If true, 'Remote Transmit Request' messages will be accepted.
      object      - CANopen object, to which buffer is connected. It will be used as
                    an argument to pFunct. Its type is (void), pFunct will change its
                    type back to the correct object type.
      pFunct      - Pointer to function, which will be called, if received CAN
                    message matches the identifier. It must be fast function.
                    See <Receive CAN message function>.

