mhaberler/canopennode/CANopen_stack/PIC24H_dsPIC33F/CO_driver.h
   Return <CO_ReturnError>:
      CO_ERROR_NO                 - Operation completed successfully.
      CO_ERROR_ILLEGAL_ARGUMENT   - Error in function arguments.
      CO_ERROR_OUT_OF_MEMORY      - Not enough masks for configuration.
*******************************************************************************/
INTEGER16 CO_CANrxBufferInit( CO_CANmodule_t   *CANmodule,
                              UNSIGNED16        index,
                              UNSIGNED16        ident,
                              UNSIGNED16        mask,
                              UNSIGNED8         rtr,
                              void             *object,
                              INTEGER16       (*pFunct)(void *object, CO_CANrxMsg_t *message));


/*******************************************************************************
   Function: CO_CANtxBufferInit

   Configure CAN message transmit buffer.

   Function configures specific CAN transmit buffer. For more information see
   topic <Transmission of CAN messages>.

   Parameters:
      CANmodule   - Pointer to CAN module object <CO_CANmodule_t>.
      index       - Index of CAN device transmit buffer to configure.
      ident       - 11-bit standard CAN Identifier.
      rtr         - If true, 'Remote Transmit Request' messages will be transmitted.
      noOfBytes   - Length of CAN message in bytes (0 to 8 bytes).
      syncFlag    - This flag bit is used for synchronous TPDO messages. If it is set,
                    message will not be sent, if curent time is outside synchronous window.

   Return:
                    Pointer to CAN transmit message buffer <CO_CANtxArray_t>.
                    8 bytes data array inside buffer should be written, before
                    <CO_CANsend> function is called.
                    Zero is returned in case of wrong arguments.
*******************************************************************************/
CO_CANtxArray_t *CO_CANtxBufferInit(
                              CO_CANmodule_t   *CANmodule,
                              UNSIGNED16        index,
                              UNSIGNED16        ident,
                              UNSIGNED8         rtr,
                              UNSIGNED8         noOfBytes,
                              UNSIGNED8         syncFlag);


/*******************************************************************************
   Function: CO_CANsend

   Send CAN message.

   For more information see topic <Transmission of CAN messages>. Before this
   function <CO_CANtxBufferInit> must be caled, which configures TX message
   buffer. Also 8 bytes of CAN data should be populated.

   Parameters:
      CANmodule   - Pointer to CAN module object <CO_CANmodule_t>.
      buffer      - Pointer to transmit buffer, returned by <CO_CANtxBufferInit>.

   Return <CO_ReturnError>:
      CO_ERROR_NO             - Operation completed successfully.
      CO_ERROR_TX_OVERFLOW    - Previous message is still waiting, buffer full.
      CO_ERROR_TX_PDO_WINDOW  - Synchronous TPDO is outside window.
*******************************************************************************/
INTEGER16 CO_CANsend(   CO_CANmodule_t   *CANmodule,
                        CO_CANtxArray_t  *buffer);


/*******************************************************************************
   Function: CO_CANclearPendingSyncPDOs

   Clear all synchronous TPDOs from CAN module transmit buffers.

   CANopen allows synchronous PDO communication only inside time between SYNC
   message and SYNC Window. If time is outside this window, new synch. PDOs
   must not be sent and all pending sync TPDOs, which may be on CAN TX buffers,
   must be cleared.

   This function checks (and aborts transmission if necessary) CAN TX buffers
   when it is called. Function should be called by application in the moment,
   when SYNC time was just passed out of synchronous window.

   Parameters:
      CANmodule   - Pointer to CAN module object <CO_CANmodule_t>.
*******************************************************************************/
void CO_CANclearPendingSyncPDOs(CO_CANmodule_t *CANmodule);


/*******************************************************************************
   Function: CO_CANverifyErrors

   Verify all errors of CAN module.

   Function is called directly from <CO_emergency_process> function.

   Parameters:
      CANmodule   - Pointer to CAN module object <CO_CANmodule_t>.
*******************************************************************************/
void CO_CANverifyErrors(CO_CANmodule_t *CANmodule);


/*******************************************************************************
   Function: CO_CANinterrupt

   CAN interrupt receives and transmits CAN messages.

   Function must be called directly from _C1Interrupt or _C2Interrupt with
   high priority. For more information see topics: <Reception of CAN messages>
   and <Transmission of CAN messages>.

   Parameters:
      CANmodule   - Pointer to CAN module object <CO_CANmodule_t>.
*******************************************************************************/
void CO_CANinterrupt(CO_CANmodule_t *CANmodule);


/*******************************************************************************
   Function: CO_ODF

   Default function for SDO server access of variables from Object Dictionary.

   dsPIC33F and PIC24H specifics: Normal copy is used in all cases. All variables
   are in RAM. (EEPROM and ROM variables may be backuped into external eeprom chip.)
   CANopen and dsPIC33F uses Little endian, so no byte inversion is implemented.
   With Big endianes, bytes must be inverted if CO_ODA_MB_VALUE bit is true.

   For more information see topic <SDO server access function> in CO_SDO.h file.
*******************************************************************************/
UNSIGNED32 CO_ODF(   void       *object,
                     UNSIGNED16  index,
                     UNSIGNED8   subIndex,
                     UNSIGNED8   length,
                     UNSIGNED16  attribute,
                     UNSIGNED8   dir,
                     void       *dataBuff,
                     const void *pData);


#endif
